#### <p style='text-align:center'> Combining Datasets </p> ####


often we need to combine relational data from various sources. This can be simple concatentation of one table on top of another or expanding the columns of the table. In the this notebook, I will demonstrate different ways to correctlly handle overlabs between datasets. 

pd.concat 
df1.append(df2)
pd.merge
* one-to-one join: similar to column-wise pd.concat 
* many-to-one join: one of the two key columns contains duplicate entries 
* many-to-many jon: key column in both right and left dataframes contain duplicates 


*Reference: Python Data Science Handbook by Jake Vanderplas *

In [1]:
import pandas as pd 
import numpy as np

In [ ]:
# let's first create a functoin which creates a DataFrame of a particular form 

def made_df(cols, ind): data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [6]:
# let's first create a functoin which creates a DataFrame of a particular form 

def make_df(cols, ind): 
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [8]:
df1 = make_df('ABC', range(3))

In [9]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [16]:
df2=make_df('ABC', [3,4,5])
print(df2)

    A   B   C
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

Simple Concatination (append rows)

In [17]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [23]:
# same indices
pd.concat([df1, df1])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

<span style='color:red'> Pandas concat function perserves indices even if you end up with duplicate indices!

To deal with duplicated indices: 

*verify_integrity* flag  
*ignore_index*

In [25]:
#verify_integrity will give you error if indices are duplicated 

pd.concat([df1,df1], verify_integrity=True)

In [26]:
# ignore_index when index dones't matter 
pd.concat([df1,df2], ignore_index=True)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

<span style='color:blue'> Adding Multindex Keys </span>

In [28]:
pd.concat([df1,df2], keys=['df1', 'df2'])

        A   B   C
df1 0  A0  B0  C0
    1  A1  B1  C1
    2  A2  B2  C2
df2 3  A3  B3  C3
    4  A4  B4  C4
    5  A5  B5  C5

In [19]:
df3 = make_df('DEF', range(3))
df3

    D   E   F
0  D0  E0  F0
1  D1  E1  F1
2  D2  E2  F2

**Row-wise concatination: inner and outer joins**

<span style='color:blue'> 1. Outer join: union

If we need to add features (in other words: join tables), input axis='columns' or axis=1

In [21]:
pd.concat([df1,df3], axis=1)

    A   B   C   D   E   F
0  A0  B0  C0  D0  E0  F0
1  A1  B1  C1  D1  E1  F1
2  A2  B2  C2  D2  E2  F2

<span style='color:blue'> 2. Inner join: intersection

In [30]:
df4 = make_df('BCD', [3,4,5])
df4

    B   C   D
3  B3  C3  D3
4  B4  C4  D4
5  B5  C5  D5

In [31]:
pd.concat([df1, df4], join='inner')

    B   C
0  B0  C0
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4
5  B5  C5

**Append Function**

In [32]:
df1.append(df2)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

### pd.merge() ###

In [45]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})

In [46]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [47]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [48]:
df3=pd.merge(df1,df2)

In [49]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### many-to-one joins ####

In [56]:
df4=pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                'supervisor': ['Carly', 'Mariam', 'Steve']})

In [57]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering     Mariam
2           HR      Steve

In [58]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012     Mariam
2     Lisa  Engineering       2004     Mariam
3      Sue           HR       2014      Steve

#### many to many joins ####

In [59]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],
                   'skills': ['math', 'spreadsheets', 'software', 'math', 'spreadsheets', 'organization']})

In [60]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering      software
3  Engineering          math
4           HR  spreadsheets
5           HR  organization

In [61]:
pd.merge(df1,df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering      software
3     Jake  Engineering          math
4     Lisa  Engineering      software
5     Lisa  Engineering          math
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [62]:
df6 = pd.DataFrame({'Name': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})

In [64]:
pd.merge(df1,df6, left_on='employee', right_on='Name')

  employee        group  Name  hire_date
0      Bob   Accounting   Bob       2008
1     Jake  Engineering  Jake       2012
2     Lisa  Engineering  Lisa       2004
3      Sue           HR   Sue       2014

In [66]:
pd.merge(df1,df6, left_on='employee', right_on='Name').drop('Name', axis=1)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [67]:
df1.join(df6)

  employee        group  Name  hire_date
0      Bob   Accounting  Lisa       2004
1     Jake  Engineering   Bob       2008
2     Lisa  Engineering  Jake       2012
3      Sue           HR   Sue       2014

In [68]:
df7 = pd.DataFrame({'name': ['Jake', 'Lisa', 'Sue', 'Bob'],
                   'salary': [70000, 80000, 120000, 90000]})
df7

   name  salary
0  Jake   70000
1  Lisa   80000
2   Sue  120000
3   Bob   90000

In [72]:
pd.merge(df1,df7, right_on='name', left_on='employee')

  employee        group  name  salary
0      Bob   Accounting   Bob   90000
1     Jake  Engineering  Jake   70000
2     Lisa  Engineering  Lisa   80000
3      Sue           HR   Sue  120000

<span style='color:red'> doing the following is wrong in this case:

In [74]:
pd.merge(df1,df7, right_index=True, left_index=True)

  employee        group  name  salary
0      Bob   Accounting  Jake   70000
1     Jake  Engineering  Lisa   80000
2     Lisa  Engineering   Sue  120000
3      Sue           HR   Bob   90000

In [86]:
adf1= df1.set_index('employee')
adf2=df2.set_index('employee')

In [87]:
adf1.join(adf2)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [89]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [90]:
adf1

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR